[
  {
    "category": "chest",
    "title": "chest muscles",
    "description": "Within the chest area, there are many muscle groups, but the most well-known among them are the pectoralis major and minor, the subclavius muscle, and the serratus anterior. They are crucial for maintaining stability and proper body posture. The most popular exercise for chest training is barbell bench press on a flat bench. However, it's worth noting that during this exercise, in addition to the chest muscles, the triceps and shoulder muscles are also actively engaged",
    "imageUrl": "https://www.fabrykasily.pl/upload/gallery/2018/03/id_9194_1521031139_c560x377x0x17,540x360.jpg",
    "name": "Chest",
    "alt": "chest exercise",
    "src": "https://static.strengthlevel.com/images/illustrations/decline-bench-press-1000x1000.jpg",
    "link": "chest"
  },
  {
    "category": "back",
    "title": "back muscles",
    "description": "Our back consists of a whole group of muscles performing various functions. Well-developed back muscles give the silhouette a V-shaped appearance. Among the largest and most visible muscles, we can include the latissimus dorsi, trapezius, and erector spinae.For a comprehensive back workout, remember to perform exercises based on vertical pulling, such as pull-ups on a bar, as well as horizontal pulling, such as barbell rows.",
    "imageUrl": "https://www.fabrykasily.pl/upload/gallery/2018/03/id_9197_1521031212_c554x373x0x13,540x360.jpg",
    "name": "Back",
    "alt": "back exercise",
    "src": "https://static.strengthlevel.com/images/illustrations/pull-ups-1000x1000.jpg",
    "link": "back"
  },
  {
    "category": "quadriceps",
    "title": "quadriceps / hamstrings",
    "description": "The following positions mostly depict compound exercises, which means that during a single movement, we engage multiple joints and muscles. Exercises in this category heavily involve the quadriceps muscles, which is why they have been classified in this category. The main function of the quadriceps muscle is knee extension. Therefore, any exercise requiring this movement will engage the quadriceps muscle.",
    "imageUrl": "https://www.fabrykasily.pl/upload/gallery/2018/03/id_9193_1521031142_c560x377x9x17,540x360.jpg",
    "name": "Quadriceps",
    "alt": "quadriceps exercise",
    "src": "https://static.strengthlevel.com/images/illustrations/dumbbell-lunge-1000x1000.jpg",
    "link": "quadriceps"
  },
  {
    "category": "hamstrings-glutes",
    "title": "glutes/hamstrings",
    "description": "This category includes exercises that heavily engage the hamstring and glute muscles. In exercises based on the hip hinge movement pattern, utilized in the deadlift, these muscles work in close synergy.The primary function of the hamstring muscle is knee flexion, for example, in the crane exercise. The glutes, on the other hand, are powerful hip extensors, playing a major role in exercises like hip thrusts with a barbell.",
    "imageUrl": "https://www.fabrykasily.pl/upload/gallery/2018/03/id_9195_1521031215_c560x377x2x4,540x360.jpg",
    "name": "Hamstrings/Glutes",
    "alt": "double-headed exercise",
    "src": "https://static.strengthlevel.com/images/illustrations/deadlift-1000x1000.jpg",
    "link": "hamstrings-glutes"
  },
  {
    "category": "shoulders",
    "title": "shoulders",
    "description": "The shoulder muscles, commonly referred to as the deltoids, form a group of muscles responsible for controlling our arms. They are divided into three parts: anterior, lateral, and posterior. The anterior deltoid serves as the driving force for most overhead presses, the lateral deltoid is largely isolated through lateral raises with dumbbells, while the posterior deltoid is responsible for moving the arm backward. To engage the posterior deltoid, perform raises in a bent-over position.",
    "imageUrl": "https://www.fabrykasily.pl/upload/gallery/2018/03/id_9190_1521030039_540x360.jpg",
    "name": "Shoulders",
    "alt": "shoulders exercise",
    "src": "https://static.strengthlevel.com/images/illustrations/shoulder-press-1000x1000.jpg",
    "link": "shoulders"
  },
  {
    "category": "abs",
    "title": "abdominal",
    "description": "The abdominal muscles are located in the center of our body and, without our conscious awareness, participate in every movement activity related to locomotion or free weight exercises. They connect the upper and lower parts of the body. Their fundamental tasks include stabilization and maintaining a straight posture. The exercises presented below aim to strengthen our muscles and assist in achieving their sculpting.",
    "imageUrl": "https://www.fabrykasily.pl/upload/gallery/2018/03/id_9192_1521031073_c560x377x0x17,540x360.jpg",
    "name": "Abs",
    "alt": "belly exercise",
    "src": "https://static.strengthlevel.com/images/illustrations/cable-crunch-1000x1000.jpg",
    "link": "abs"
  },
  {
    "category": "biceps",
    "title": "biceps",
    "description": "As the name suggests, this is a muscle composed of two heads. The short head is located on the inner side of the arm, and the long head is on the outer side. Just below them is the brachialis muscle, which, together with the biceps, flexes the elbow joint. Basic exercises aimed at developing our biceps include arm curls with dumbbells or a barbell. However, let's not forget the significant involvement of the biceps and shoulder muscles in back muscle exercises.",
    "imageUrl": "https://www.fabrykasily.pl/upload/gallery/2018/03/id_9191_1521031033_c560x377x0x17,540x360.jpg",
    "name": "Biceps",
    "alt": "biceps exercise",
    "src": "https://static.strengthlevel.com/images/illustrations/dumbbell-curl-1000x1000.jpg",
    "link": "biceps"
  },
  {
    "category": "triceps",
    "title": "triceps",
    "description": "The muscle occupying about 2/3 of the volume of our arm is composed of three heads: lateral, long, and medial. The main function of the muscle is extension at the elbow joint, so any exercise involving this movement will engage our triceps.Among the most popular exercises are dips, a bodyweight exercise, and French presses, typically performed using an EZ bar or dumbbells.",
    "imageUrl": "https://www.fabrykasily.pl/upload/gallery/2018/03/id_9198_1521031241_c560x377x9x17,540x360.jpg",
    "name": "Triceps",
    "alt": "triceps exercise",
    "src": "https://static.strengthlevel.com/images/illustrations/dips-1000x1000.jpg",
    "link": "triceps"
  }
]